[
    {
        "title": "Do Premium Grocery Stores Offer Less Processed Foods?",
        "image": "images/final_plot.png",
        "year": 2025,
        "description": "This project uses visualization to compares how processed the products sold at Whole Foods, Walmart, and Target through FPro scores. By visualizing product distributions across each store, the analysis reveals clear differences between stores. Walmart and Target both skew heavily toward highly processed foods, while Whole Foods shows a more balanced spread with a greater share of minimally processed items. These results support the idea that Whole Foods offers less processed products than typical grocery retailers."
    },
    {
        "title": "Quick and Delicious: Does Cooking Time Predict Recipe Rating?",
        "image": "",
        "year": 2025,
        "description": "This project explored if what features of a dataset could predict recipe rating through data analysis and modeling. Starting with a simple baseline model using three numerical features, we achieved an F1 score of 0.741, but needed more complexity to capture user preferences. By engineering features such as nutritional ratios, ingredient patterns, tag encodings, and user behavior signals, and using a tuned Random Forest Classifier, our final model reached an F1 score of 0.87. We showed that enjoyment is influenced by multiple factors and that thoughtful feature engineering can significantly improve predictive performance."
    },
    {
        "title": "Persuasive or Deceptive Visualization Analysis",
        "image": "",
        "year": 2025,
        "description": "In this project, a group of classmates and I created two visualzations, one that is for our propositon and one against. This was an exercise in understanding how visualizations can be used to persuade or deceive an audience depending on the data presented and the design choices made."
    },
    {
        "title": "Image Processing and Classification Application",
        "image": "",
        "year": 2024,
        "description": "I designed and implemented a modular image processing suite using OOP principles, featuring a custom class for RGB manipulation with methods for negation, grayscale, and blur. Additionally, I developed an Image KNN Classifier capable of performing tasks like day/night image classification through Euclidean distance calculation and model fitting."
    },
    {
        "title": "K-Nearest Neighbors Classifier for Handwritten Digits",
        "image": "",
        "year": 2024,
        "description": "I developed a K-Nearest Neighbors model that classifies handwritten digits from the MNIST dataset with over 90% accuracy. This involved implementing a custom priority queue to efficiently find the nearest neighbors and processing the 28x28 grayscale images into 1-D arrays for the algorithm. I also integrated visualization tools to display the model's predictions."
    },
    {
        "title": "Movie Search Engine",
        "image": "",
        "year": 2024,
        "description": "I developed a search engine using Binary Search Trees (BSTs) to index and efficiently query movie data by actors, studios, and ratings. The system features a dynamic query function that returns relevant, non-duplicate results by finding intersections between search keywords, with case-insensitive handling for improved usability."
    },
    {
        "title": "N-Gram Language Model Development",
        "image": "",
        "year": 2025,
        "description": "I developed a custom n-gram language model from scratch in Python, which involved processing a large text corpus and building foundational uniform and unigram models. The implementation included creating n-grams, calculating probabilities, and generating new text samples."
    },
    {
        "title": "Bike Watching",
        "image": "images/bikewatch.png",
        "year": 2025,
        "description": "Visualizing bike paths and stations of the Boston area through javascript and d3."
    },
    {
        "title": "Amet id iusto quisquam?",
        "image": "",
        "year": 2023,
        "description": "Saepe harum voluptatum ratione inventore quasi dicta modi necessitatibus aperiam nesciunt esse itaque autem corporis voluptatem doloribus eum blanditiis, quaerat sunt incidunt nisi, delectus est eos. Mollitia molestiae autem pariatur?"
    },
    {
        "title": "Nesciunt amet blanditiis unde?",
        "image": "",
        "year": 2022,
        "description": "Rerum, laborum vitae quisquam odit dolore molestias beatae quod minima? Amet praesentium voluptatibus veritatis expedita voluptate non. Maxime voluptate totam, expedita sit eveniet enim quas nobis eum numquam nihil doloremque."
    },
    {
        "title": "Ab cumque eos natus.",
        "image": "",
        "year": 2021,
        "description": "Deleniti fugiat laborum provident eius voluptatum suscipit, quas quae doloribus enim temporibus nihil modi quia itaque nisi, molestiae ad quasi ullam eum pariatur expedita perspiciatis blanditiis facere, neque exercitationem? Recusandae."
    },
    {
        "title": "Nulla quas similique omnis.",
        "image": "",
        "year": 2021,
        "description": "Possimus quisquam libero facere? Aliquam nihil numquam dicta, qui dignissimos in vitae quos non! Laboriosam voluptate, vitae temporibus repellendus, hic dolorem expedita nulla ea incidunt veritatis odit ullam ex omnis."
    }
]